#### Terraform Plan 📖

<details><summary>Plan 결과 보기</summary>

```
module.compute.tls_private_key.ec2_key: Refreshing state... [id=dc06b7df5318e96cbac3450e11147509de8fe3b2]
module.compute.local_file.private_key: Refreshing state... [id=7083f0873e048b6f135ce633f0519fc24ea15f6f]
module.vpc.data.aws_availability_zones.available: Reading...
module.compute.data.aws_ami.amazon_linux: Reading...
module.compute.aws_key_pair.ec2_key: Refreshing state... [id=cine-catch-key]
module.storage.aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=E1B1JDRSHBVZA0]
module.storage.aws_cloudfront_function.strip_origin: Refreshing state... [id=cine-catch-strip-origin]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0e2330811ddc5348e]
module.storage.aws_s3_bucket.cine_catch_deploy: Refreshing state... [id=cine-catch-deploy]
module.compute.aws_iam_role.ec2_role: Refreshing state... [id=cine-catch-ec2-role]
module.storage.aws_s3_bucket.frontend: Refreshing state... [id=cine-catch-frontend]
module.storage.aws_s3_bucket.cine_catch_image: Refreshing state... [id=cine-catch-image]
module.compute.aws_iam_role_policy.s3_access: Refreshing state... [id=cine-catch-ec2-role:s3-deploy-access]
module.compute.aws_iam_instance_profile.ec2_profile: Refreshing state... [id=cine-catch-ec2-profile]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=ap-northeast-2]
module.compute.data.aws_ami.amazon_linux: Read complete after 1s [id=ami-0092e0c93f74c293a]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0e88f77f1841d66f7]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0be8a812e8b269c64]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0faa9eebfcf2cbb80]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-05504be344cc66e88]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e06d8473488c3933]
module.storage.aws_security_group.db_sg: Refreshing state... [id=sg-0775034bbb81e80c9]
module.security.aws_security_group.web_sg: Refreshing state... [id=sg-0c7a96cf0e3ca435f]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0c0e87bf4b3ca3cef]
module.storage.aws_db_subnet_group.database: Refreshing state... [id=cine-catch-db-subnet-group-v2]
module.storage.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=cine-catch-frontend]
module.storage.aws_s3_bucket_website_configuration.frontend: Refreshing state... [id=cine-catch-frontend]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c86192e07b10b3f0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f119f4d27c34cb9a]
module.compute.aws_instance.app_server: Refreshing state... [id=i-0a56f3a3990b89127]
module.storage.aws_db_instance.cine_catch_db: Refreshing state... [id=db-GS4WPJAJFA6ZW6AXHSBIGQBBME]
module.compute.aws_eip.app_server: Refreshing state... [id=eipalloc-01bb67c8b0f2ec5e1]
module.storage.aws_cloudfront_distribution.frontend: Refreshing state... [id=E3DO93CNW2AJ73]
module.storage.aws_s3_bucket_policy.frontend: Refreshing state... [id=cine-catch-frontend]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.compute.local_file.private_key has been deleted
  - resource "local_file" "private_key" {
      - filename             = "modules/compute/cine-catch-key.pem" -> null
        id                   = "7083f0873e048b6f135ce633f0519fc24ea15f6f"
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.compute.local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "modules/compute/cine-catch-key.pem"
      + id                   = (known after apply)
    }

  # module.compute.tls_private_key.ec2_key will be updated in-place
  ~ resource "tls_private_key" "ec2_key" {
        id                            = "dc06b7df5318e96cbac3450e11147509de8fe3b2"
        # (10 unchanged attributes hidden)
    }

  # module.storage.aws_db_instance.cine_catch_db will be updated in-place
  ~ resource "aws_db_instance" "cine_catch_db" {
        id                                    = "db-GS4WPJAJFA6ZW6AXHSBIGQBBME"
        tags                                  = {
            "Name" = "cine-catch-db"
        }
        # (56 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Gyanni, Action: `pull_request`*